Documents/НазначениеКонструктора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеКонструктора</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтадииКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтадииКомплекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВторойУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПервыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТретийУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЧетвертыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыврдитьЧетвертыйВместоТретьего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченныйПоказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеЭтапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НазначениеКонструктора/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура НазначитьНаСервере()

	ИзменитьКонструктораКомплекта(Объект.Комплект, Объект.НовыйКонструктор);
	
	Для каждого х Из Объект.Комплекты Цикл
		Если ТекущийКонструктор = х.ТекущийКонструктор Тогда
			ИзменитьКонструктораКомплекта(х.Комплект, Объект.НовыйКонструктор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

Процедура ИзменитьКонструктораКомплекта(Комплект, НовыйКонструктор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(Комплект);
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	НоваяЗапись.Период 		= ТекущаяДата();
	НоваяЗапись.Автор 		= Объект.Автор;
	НоваяЗапись.Комплект 	= Комплект;
	НоваяЗапись.Конструктор = НовыйКонструктор;
	
	НаборЗаписей.Записать(); 
	
	омКонструктор.ИзменитьИсполнителяВЗадаче(Комплект, НовыйКонструктор);	
	
КонецПроцедуры


&НаКлиенте
Процедура Назначить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйКонструктор) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен конструктор");
		Возврат;
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен комплект");
		Возврат;
	
	КонецЕсли; 
	
	НазначитьНаСервере();
	
	Записать();
	
	Закрыть();
	
КонецПроцедуры

Процедура КомплектПриИзмененииНаСервере()
	
	ТекущаяСтадия 			= Справочники.СтадииКомплекта.ПустаяСсылка();
	ТекущийКонструктор 		= Справочники.Сотрудники.ПустаяСсылка();
	ТекущиеСостояниеЗадачи 	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
			|	ДанныеКомплектаСрезПоследних.Конструктор КАК ТекущийКонструктор
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
			|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
			|	ТаймингЗадачСрезПоследних.Задача.ТипЗадачи КАК ТипЗадачи
			|ИЗ
			|	РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
			|ГДЕ
			|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ = &Комплект
			|	И НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
		
		Запрос.УстановитьПараметр("Комплект", Объект.Комплект);
		
		Результат = Запрос.ВыполнитьПакет();
		Выборка = Результат[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		КонецЦикла; 
		
		Выборка = Результат[1].Выбрать();
		
		ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором;		
		
		Пока Выборка.Следующий() Цикл
			ТекущиеСостояниеЗадачи 	= Выборка.Состояние;
			ТекущаяЗадача 			= Выборка.Задача;
			ТипЗадачи 				= Выборка.ТипЗадачи;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
	
		Элементы.ФормаНазначить.Доступность = Истина;
		Элементы.Декорация1.Видимость		= Ложь; 
		
		Для каждого х Из Объект.Комплекты Цикл
		
			Если ТекущийКонструктор = х.ТекущийКонструктор Тогда
				
				Если х.ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
					
					Элементы.ФормаНазначить.Доступность = Ложь;
					Элементы.Декорация1.Видимость		= Истина;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;	
		
		КонецЦикла;
		
	Иначе
		
		Элементы.ФормаНазначить.Доступность = Ложь;
		Элементы.Декорация1.Видимость		= Истина;
	
	КонецЕсли; 
	
	Объект.Комплекты.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Комплект) И Тип("СправочникСсылка.Композиции") = ТипЗнч(Объект.Комплект) Тогда
		
	 	Объект.Комплекты.Загрузить(омКомпозицииСервер.ПолучитьКомплектыСКонструкторами(Объект.Комплект));
			
	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	ВидимостьТаблицы();
	КомплектПриИзмененииНаСервере();
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидимостьТаблицы()

	Если ЗначениеЗаполнено(Объект.Комплект) И Тип("СправочникСсылка.Композиции") = ТипЗнч(Объект.Комплект) Тогда
	
		Элементы.Комплект.Заголовок = "Композиция";
		Элементы.Комплекты.Видимость = Истина;
			
	Иначе
	
		Элементы.Комплект.Заголовок = "Комплект";
		Элементы.Комплекты.Видимость = Ложь;
		
	КонецЕсли;	

КонецПроцедуры // ВидимостьТаблицы()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация1.Видимость					= Параметры.Ключ.Пустая();
	Элементы.КомплектыТекущийКонструктор.Видимость	= Элементы.Декорация1.Видимость;
	Элементы.КомплектыТекущаяЗадача.Видимость		= Элементы.Декорация1.Видимость;
	Элементы.КомплектыТекущаяСтадия.Видимость		= Элементы.Декорация1.Видимость;
	Элементы.ФормаНазначить.Доступность 			= Элементы.Декорация1.Видимость;
	
	ТолькоПросмотр 									= НЕ Элементы.Декорация1.Видимость;
	
	Если Элементы.Декорация1.Видимость Тогда
		
		КомплектПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ВидимостьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "КомплектыТекущийКонструктор" Тогда
			ОткрытьФорму("Справочник.ИзделияКомплект.ФормаОбъекта", Новый Структура("Ключ", ТД.Комплект), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "КомплектыТекущийКонструктор" И ЗначениеЗаполнено(ТД.ТекущийКонструктор) Тогда
			ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", Новый Структура("Ключ", ТД.ТекущийКонструктор), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "КомплектыТекущаяЗадача" И ЗначениеЗаполнено(ТД.ТекущаяЗадача) Тогда
			Если ТипЗнч(ТД.ТекущаяЗадача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
				СтрокаТипа = "Задача.Задачи_ПКД.ФормаОбъекта";	
			Иначе
				СтрокаТипа = "Задача.Задачи_РКД.ФормаОбъекта";	
			КонецЕсли;
			
			ОткрытьФорму(СтрокаТипа, Новый Структура("Ключ", ТД.ТекущаяЗадача), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	КомплектПриИзмененииНаСервере();
КонецПроцедуры
